// var a = 9;
// var b= 10;

// var res = a + b;

// console.log(res);

// alert(res);


// a = 'Hello World';


// // int целое число
// // double дробное
// // string строка


// var a = 6;
// var b = 10;
// var c = 2;

// c += --b - --b + ++a + b++ + --b - --b - b + b - --a + a - --a -a;
// /*
//      a = 5
//      b = 7

//      9 - 8 + 7 + 8 + 8 - 7 - 7 + 7 - 6 + 6 - 5 - 5
// */
// console.log(c);

// /*

// true
// false

// += -= *= /=

// 15 -1
// < > == != >= <= 
// === !==

// () && () && () && () ..

// () || () || () || () || ()

// && 

// Префиксная форма:
// 1. Вначале +1 -> получает значение

// Постфикная форма -получает -> +1

// --variable - префиксный декремент
// variable-- - постфиксный декремент
// ++variable - префиксный инкремент
// variable++ - постфиксный инкремент

// if
// */

// if (a < b) {
//     console.log(a);
// }

// let mas = [1,2,3,4,5,6,7,8,9,10 ]

// let sum = 0;

// for (let i = 0; i < mas.length; i++) {
//     if (mas[i] % 2 === 0) {
//         sum += mas[i];
//     }
// }

// console.log(sum); 

// let mas = [1,2,3,4,5[2,4,5,6,67],7,8,9];

// let val = mas[5]

// console.log(val);



